var listTest = [];
listTest[0] = [["Рестораны", [55.74345, 37.38122], "Макдак", "food"], ["Рестораны", [55.74345, 37.38122], "Парк", "landmark"], ["Рестораны", [55.74345, 37.38122], "ЗаРядье", "social_spase"], ["Рестораны", [55.74345, 37.38122], "WC", "wc"], ["Рестораны", [55.74345, 37.38122], "Макдак", "transport"]]
listTest[1] = [["Рестораны", [55.74345, 37.38122], "Макдак", "food"], ["Рестораны", [55.74345, 37.38122], "Парк", "landmark"], ["Рестораны", [55.74345, 37.38122], "ЗаРядье", "social_spase"], ["Рестораны", [55.74345, 37.38122], "WC", "wc"], ["Рестораны", [55.74345, 37.38122], "Макдак", "transport"]]
listTest[2] = [["Рестораны", [55.74345, 37.38122], "Макдак", "food"], ["Рестораны", [55.74345, 37.38122], "Парк", "landmark"], ["Рестораны", [55.74345, 37.38122], "ЗаРядье", "social_spase"], ["Рестораны", [55.74345, 37.38122], "WC", "wc"], ["Рестораны", [55.74345, 37.38122], "Макдак", "transport"]]
listTest[3] = [["Рестораны", [55.74345, 37.38122], "Макдак", "food"], ["Рестораны", [55.74345, 37.38122], "Парк", "landmark"], ["Рестораны", [55.74345, 37.38122], "ЗаРядье", "social_spase"], ["Рестораны", [55.74345, 37.38122], "WC", "wc"], ["Рестораны", [55.74345, 37.38122], "Макдак", "transport"]]
listTest[4] = [["Рестораны", [55.74345, 37.38122], "Макдак", "food"], ["Рестораны", [55.74345, 37.38122], "Парк", "landmark"], ["Рестораны", [55.74345, 37.38122], "ЗаРядье", "social_spase"], ["Рестораны", [55.74345, 37.38122], "WC", "wc"], ["Рестораны", [55.74345, 37.38122], "Макдак", "transport"]]


// listTest[0] = ["Рестораны", [55.74345, 37.38122], "Макдак", "food"]
// listTest[1] = ["Рестораны", [55.74345, 37.38122], "Хуита", "landmark"]
// listTest[2] = ["Рестораны", [55.74345, 37.38122], "Залупа", "social_spase"]
// listTest[3] = ["Рестораны", [55.74345, 37.38122], "Толкан", "wc"]
// listTest[4] = ["Рестораны", [55.74345, 37.38122], "Макдак", "transport"]

var places = document.getElementById("list-places");

for (let index = 0; index < 5; index++) {
    places.innerHTML += '<li><a onclick="setList(listTest['+index+'])">'+listTest[0][0][2]+'->'+listTest[0][1][2]+'->'+listTest[0][2][2]+'->'+listTest[0][3][2]+'->'+listTest[0][4][2]+'</a></li>';
}

// for (let index = 0; index < 5; index++) {
//     places.innerHTML += ```<li><a onclick="setList(${listTest[index]})">${listTest[0][0][2]}->${listTest[0][1][2]}->${listTest[0][2][2]}->${listTest[0][3][2]}->${listTest[0][4][2]}</a></li>```
// }



function setList(index) {
    console.log(index);
    return index;
}